Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Team Polaris provides a flexible distribution environment for each customer including the ability to deploy on private cloud (on-premise) or hosted cloud environments. The Abraxas platform team provisions the cloud infrastructure dependent upon the client requirements. The development teams have the ability to configure their customized environments and deploy their applications. The tax solution is currently in the development stage and is running in both a dev and staging environment with production rollout planned for 2022 with updates and enhancements coming soon after.
ja_jp: チームポラリスは、プライベートクラウド（オンプレミス）やホステッドクラウド環境での展開を含め、各顧客に柔軟な配信環境を提供しています。Abraxasのプラットフォームチームは、お客様の要件に応じてクラウドインフラストラクチャを準備します。開発チームは、カスタマイズされた環境を構成して、アプリケーションを展開することができます。税務ソリューションは現在、開発段階にあり、開発環境とステージング環境の両方で稼働しています。

source: Technical Evolution During Incubation
ja_jp: インキュベーション期間中の技術的進化

source: Technical Resource that covers tools, components, and commands. The encyclopedia for Quarkus.
ja_jp: ツール、コンポーネント、コマンドを網羅したテクニカルリソース。Quarkusの百科事典。

source: Technical aspect
ja_jp: 技術的な側面

source: Technical overview
ja_jp: 技術的な概要

source: Telemetry
ja_jp: テレメトリー

source: Telemetry Support
ja_jp: テレメトリーのサポート

source: Telemetry contains data about the internal state of the system and can be split into categories or *signals*:
ja_jp: テレメトリーにはシステムの内部状態に関するデータが含まれており、カテゴリーまたは *シグナル* に分類できます。

source: Telemetry for the `BasicWebSocketConnector` is currently not supported.
ja_jp: `BasicWebSocketConnector` のテレメトリーは現在サポートされていません。

source: Tell Quarkus to run the HTTP permission check after the tenant has been selected with the `@Tenant` annotation.
ja_jp: `@Tenant` アノテーションを使用してテナントを選択した後、Quarkus に HTTP 権限チェックを実行するように指示します。

source: Template "base"
ja_jp: テンプレート "base"

source: Template "detail"
ja_jp: テンプレート "detail"

source: Template Accessing Class Constants
ja_jp: クラス定数にアクセスするテンプレート

source: Template Accessing Enum Constants
ja_jp: enum 定数にアクセスするテンプレート

source: Template Contents
ja_jp: テンプレートの内容

source: Template Contents Example
ja_jp: テンプレートコンテンツの例

source: Template Example
ja_jp: テンプレートの例

source: Template Extension Methods
ja_jp: テンプレート拡張メソッド

source: Template Locator
ja_jp: テンプレートロケーター

source: Template Locator Registration
ja_jp: テンプレートロケーターの登録

source: Template Parameter Declarations
ja_jp: テンプレートパラメーター宣言

source: Template Records
ja_jp: テンプレートレコード

source: Template Variants
ja_jp: テンプレートバリアント

source: Template and styling support
ja_jp: テンプレートとスタイリングのサポート

source: Template expressions can be optionally type-safe. Which means that an expression is validated against the existing Java types and template extension methods. If an invalid/incorrect expression is found then the build fails.
ja_jp: テンプレート式は、オプションでタイプセーフにすることができます。これは、式が既存のJavaの型とテンプレート拡張メソッドに対して検証されることを意味します。無効な/不正確な式が見つかった場合、ビルドは失敗します。

source: Template extension methods are used to extend the set of accessible properties of data objects. Qute support in Quarkus Tools for IntelliJ has support for marked `@TemplateExtension` Java methods, which extend a given data model.
ja_jp: テンプレートエクステンションメソッドは、データオブジェクトのアクセス可能なプロパティのセットを拡張するために使用されます。Quarkus Tools for IntelliJ の Qute サポートでは、マークされた `@TemplateExtension` Java メソッドをサポートしており、指定されたデータモデルを拡張することができます。

source: Template extension methods are used to extend the set of accessible properties of data objects. Qute support in Quarkus Tools for Visual Studio Code has support for marked `@TemplateExtension` Java methods, which extend a given data model.
ja_jp: テンプレート拡張メソッドは、データオブジェクトのアクセス可能なプロパティのセットを拡張するために使用されます。Quarkus Tools for Visual Studio Code の Qute サポートでは、マーク付きの `@TemplateExtension` Java メソッドをサ ポートしており、与えられたデータモデルを拡張することができます。

source: Template inheritance makes it possible to reuse template layouts.
ja_jp: テンプレート継承により、テンプレートレイアウトの再利用が可能になります。

source: Template initializers
ja_jp: テンプレートイニシャライザー

source: Template locators
ja_jp: テンプレートロケーター

source: Template objects for <<bytecode-recording,bytecode recording>>
ja_jp: <<bytecode-recording,bytecode recording>> のテンプレートオブジェクト

source: Template parameter declaration inside the template itself
ja_jp: テンプレート内部のテンプレートパラメーター宣言

source: Templates
ja_jp: テンプレート

source: Templates (Qute)
ja_jp: テンプレート（Qute）

source: Templates can be rendered as a `CompletionStage<String>` (completed with the rendered output asynchronously) or as `Publisher<String>` containing the rendered chunks:
ja_jp: テンプレートは、 `CompletionStage<String>` (非同期にレンダリングされた出力で完了)としてレンダリングすることも、レンダリングされたチャンクを含む `Publisher<String>` としてレンダリングすることもできます。

source: Templates for Azure Functions deployment descriptors (`host.json`, `function.json`) are within the `azure-config` directory. Edit them as you need to. Rerun the build when you are ready.
ja_jp: Azure Functions デプロイメントディスクリプタのテンプレート ( `host.json` , `function.json` ) は、 `azure-config` ディレクトリー内にあります。必要に応じて編集してください。準備ができたらビルドを再実行します。

source: Templates located in the `pub` directory are served via HTTP. This behavior is built-in, no controllers are needed. For example, the template `src/main/resources/templates/pub/foo.html` will be served from the paths `/foo` and `/foo.html` by default.
ja_jp: `pub` ディレクトリーにあるテンプレートは、HTTP 経由で提供されます。この動作は組み込みであり、コントローラーは必要ありません。たとえば、テンプレート `src/main/resources/templates/pub/foo.html` は、デフォルトではパス `/foo` と `/foo.html` から提供されます。

source: Templating engine could be also very useful when rendering periodic reports. You'll need to add the `quarkus-scheduler` and `quarkus-qute` extensions first. In your `pom.xml` file, add:
ja_jp: テンプレーティングエンジンは、定期的なレポートをレンダリングする際にも非常に便利かもしれません。最初に `quarkus-scheduler` と `quarkus-qute` のエクステンションを追加する必要があります。 `pom.xml` ファイルに追加します。

source: Templating with Qute
ja_jp: Quteを使ったテンプレート

source: Temporarily stops running tests. This can be useful if you are making lots of changes, and don't want feedback until they are all done.
ja_jp: テストの実行を一時的に停止します。これは、多くの変更を行っていて、すべてが完了するまでフィードバックを得たくない場合に便利です。

source: Tenant
ja_jp: テナント

source: Tenant Resolution for OIDC 'web-app' applications
ja_jp: OIDCの "web-app" アプリケーションのためのテナント解決

source: Tenant `tenant-a` discovers the `issuer` from the OIDC provider's well-known configuration endpoint.
ja_jp: テナント `tenant-a` は、OIDC プロバイダーの既知の設定エンドポイントから `issuer` を検出します。

source: Tenant `tenant-a` is resolved when the incoming HTTP request contains the `Custom-Authorization-1` header.
ja_jp: テナント `tenant-a` は、受信 HTTP リクエストに `Custom-Authorization-1` ヘッダーが含まれている場合に解決されます。

source: Tenant `tenant-b` configures the `issuer` because its OIDC provider does not support the discovery.
ja_jp: テナント `tenant-b` は、OIDC プロバイダーが検出をサポートしていないため、`issuer` を設定します。

source: Tenant `tenant-b` is resolved if the request contains the `Custom-Authorization-2` header.
ja_jp: テナント `tenant-b` は、リクエストに `Custom-Authorization-2` ヘッダーが含まれている場合に解決されます。

source: Tenant id
ja_jp: テナント ID

source: Tenant identifiers are also recorded in the session cookie names after the authentication is completed. Therefore, authenticated users can access the secured application area without requiring either the `google` or `github` path values to be included in the secured URL.
ja_jp: 認証が完了すると、テナント識別子もセッション Cookie 名に記録されます。したがって、認証されたユーザーは、セキュアな URL に `google` または `github` パス値を含める必要なく、セキュアなアプリケーション領域にアクセスできます。

source: Tenant resolution
ja_jp: テナントの解決

source: Tenant resolution for OIDC web-app applications
ja_jp: OIDC web-app アプリケーションのテナント解決

source: Tenant resolution for the OIDC `web-app` applications must be done at least 3 times during an authorization code flow, when the OIDC tenant-specific configuration affects how each of the following steps is run.
ja_jp: OIDC `web-app` アプリケーションのテナント解決は、OIDC テナント固有の設定が次の各手順の実行方法に影響する場合、認可コードフロー中に少なくとも 3 回実行する必要があります。

source: Tenant resolution order
ja_jp: テナント解決の順序

source: Tenant resolution properties
ja_jp: テナント解決プロパティー

source: Tenants `tenant-a` and `tenant-b` are resolved using a JWT access token's issuer `iss` claim value.
ja_jp: テナント `tenant-a` と `tenant-b` は、JWT アクセストークンの issuer `iss` クレーム値を使用して解決されます。

source: Terminate both java processes (`kill 2495275 2495369`).
ja_jp: 両方のJavaプロセスを終了してください( `kill 2495275 2495369`)。

source: Terminology
ja_jp: 用語解説

source: Ternary Operator: `condition ? ifTrue : ifFalse`
ja_jp: 三項演算子: `condition ? ifTrue : ifFalse`

source: Test
ja_jp: テスト

source: Test Coverage Reports
ja_jp: テストカバレッジレポート

source: Test OIDC DevService
ja_jp: OIDC DevService のテスト

source: Test Security Extension
ja_jp: セキュリティーエクステンションのテスト

source: Test coverage and `QuarkusUnitTest`
ja_jp: テストカバレッジと `QuarkusUnitTest`

source: Test coverage is usually defined as a metric that measures the percentage of code executed by tests. Some developers doubt its usefulness but I agree with https://martinfowler.com/bliki/TestCoverage.html[Martin Fowler's] opinion that _"Test coverage is a useful tool for finding untested parts of a codebase"_. I don't think the resulting number itself is important. After all, writing a test for a generated getter makes no sense at all. However, if it's possible to identify poorly tested code in a hot path of your extension, then you can improve the test suite and spot bugs before the release, which always pays off. Just as importantly, you can increase the ability to catch regressions.
ja_jp: テストカバレッジは通常、テストによって実行されたコードの割合を測定する指標として定義されます。その有用性を疑う開発者もいますが、私は「テストカバレッジは、コードベースのテストされていない部分を見つけるための有用なツールである」という https://martinfowler.com/bliki/TestCoverage.html[Martin Fowler 氏]の意見に同意します。算出される数値自体が重要だとは思いません。結局のところ、生成された getter のテストを書くことには全く意味がありません。しかし、エクステンションのホットパスにおいてテストが不十分なコードを特定できれば、テストスイートを改善し、リリース前にバグを発見することができます。これは常に報われる作業です。同様に重要なこととして、リグレッションを捕捉する能力を高めることもできます。

source: Test fixtures in Gradle don't work properly yet
ja_jp: Gradleでテストフィクスチャがまだ正しく動作しません

source: Test if everything works by starting up Quarkus in dev mode:
ja_jp: 開発モードでQuarkusを起動して、すべてが動作するかどうかをテストします。

source: Test resources are global, even if they are defined on a test class or custom profile, which means they will all be activated for all tests, even though we do remove duplicates. If you want to only enable a test resource on a single test class or test profile, you can use `@QuarkusTestResource(restrictToAnnotatedClass = true)`.
ja_jp: テストリソースは、テストクラスまたはカスタムプロファイルで定義されている場合でもグローバルです。つまり、重複を削除しても、すべてのテストですべてアクティブになります。 単一のテストクラスまたはテストプロファイルに限定してテストリソースを有効にする場合は、 `@QuarkusTestResource(restrictToAnnotatedClass = true)` を使用できます。

source: Test the Application
ja_jp: アプリケーションのテスト

source: Test the Quarkus Let's Encrypt ACME feature from your local machine.
ja_jp: ローカルマシンから Quarkus Let's Encrypt ACME 機能をテストします。

source: Test the Quarkus endpoint
ja_jp: Quarkus エンドポイントのテスト

source: Test the application
ja_jp: アプリケーションのテスト

source: Test the changes
ja_jp: 変更をテストする

source: Test the constraints
ja_jp: 制約のテスト

source: Test the following queries with GraphiQL:
ja_jp: 以下のクエリをGraphiQLでテストしてみましょう。

source: Test the following queries with the `GraphQL UI`:
ja_jp: 以下のクエリを `GraphQL UI` でテストしてみましょう。

source: Test the security of your Quarkus applications.
ja_jp: Quarkusアプリケーションのセキュリティをテストします。

source: Test the solver
ja_jp: ソルバーのテスト

source: Test with Swagger UI or GrapghQL UI
ja_jp: Swagger UIまたはGrapghQL UIでテスト

source: Test with Swagger UI or GraphQL UI
ja_jp: Swagger UI または GraphQL UI を使用したテスト

source: Test with enabled persistence
ja_jp: 永続性を有効にしたテスト

source: Test your application
ja_jp: アプリケーションのテスト

source: Test your application in dev mode by using Dev Services for PostgreSQL
ja_jp: PostgreSQL 用 Dev Services を使用して開発モードでアプリケーションをテストします。

source: Test your application in production mode by using Curl or browser
ja_jp: Curl またはブラウザーを使用して、実稼働環境でアプリケーションをテストします。

source: TestHTTPResource
ja_jp: テストHTTPリソース

source: TestSecurity annotation
ja_jp: TestSecurity アノテーション

source: Testcontainers and Quarkus Dev Services also expect the container service they make requests against to be non-interactive. In case you have multiple registries configured in your Docker or Podman configuration, Podman responds with a prompt asking which registry should be used to pull containers from in case the containers pulled are specified by short name.
ja_jp: TestcontainersとQuarkus Dev Servicesも、リクエストするコンテナサービスが非インタラクティブであることを期待しています。DockerまたはPodmanの設定で複数のレジストリを構成している場合、Podmanは、pullするコンテナが短縮名で指定されている場合、どのレジストリを使ってコンテナを引き出すべきかを尋ねるプロンプトで応答します。

source: Testcontainers and Quarkus Dev Services also expect the container service they make requests against to be non-interactive. In case you have multiple registries configured in your Docker or Podman configuration, and when using short image names, Podman responds with a prompt asking which registry should be used to pull images.
ja_jp: Testcontainers と Quarkus Dev Services も、リクエストするコンテナサービスが非インタラクティブであることを期待しています。Docker または Podman の設定で複数のレジストリを構成している場合、およびイメージの略称を使用している場合、Podman は、どのレジストリを使ってコンテナを引き出すべきかを尋ねるプロンプトで応答します。

source: Testcontainers privileges
ja_jp: テストコンテナー権限

source: Testcontainers will map these ports to random ports on the host. This avoids port conflicts, but presents a new problem – how do applications connect to the service in the container?
ja_jp: Testcontainers は、これらのポートをホスト上のランダムなポートにマッピングします。これによりポートの競合は回避されますが、アプリケーションはコンテナー内のサービスにどのように接続するのか、という新たな問題が発生します。

source: Tested components
ja_jp: テスト対象コンポーネント

source: Testing
ja_jp: テスト

source: Testing Build time data
ja_jp: ビルド時データのテスト

source: Testing Command Mode Applications
ja_jp: コマンドモードアプリケーションのテスト

source: Testing Components
ja_jp: コンポーネントのテスト

source: Testing Dev Services
ja_jp: 開発サービスのテスト

source: Testing Different Profiles
ja_jp: 異なるプロファイルのテスト

source: Testing Extensions
ja_jp: エクステンションのテスト

source: Testing Runtime data
ja_jp: 実行時データのテスト

source: Testing Security
ja_jp: セキュリティーのテスト

source: Testing WebAuthn
ja_jp: WebAuthnのテスト

source: Testing WebAuthn can be complicated because normally you need a hardware token, which is why we've made the `quarkus-test-security-webauthn` extension:
ja_jp: 通常、ハードウェアトークンが必要なため、WebAuthn のテストは複雑です。そのため、私たちは `quarkus-test-security-webauthn` というエクステンションを作りました。

source: Testing WebAuthn can be complicated because normally you need a hardware token, which is why we've made the `quarkus-test-security-webauthn` helper library:
ja_jp: 通常、ハードウェアトークンが必要なため、WebAuthn のテストは複雑です。そのため、 私たちは `quarkus-test-security-webauthn` というヘルパーライブラリーを作りました。

source: Testing Your Application
ja_jp: アプリケーションのテスト

source: Testing a Kafka application
ja_jp: Kafka アプリケーションのテスト

source: Testing a reactive application is similar to testing a non-reactive one: use the HTTP endpoint and verify the HTTP responses. The fact that the application is reactive does not change anything.
ja_jp: リアクティブなアプリケーションのテストは、非リアクティブなアプリケーションのテストと同様に、 HTTP エンドポイントを使用して、HTTP レスポンスを検証します。アプリケーションがリアクティブであることによる差異はありません。

source: Testing a specific endpoint
ja_jp: 特定のエンドポイントのテスト

source: Testing alongside other JUnit Extensions
ja_jp: 他の JUnit エクステンションとの連携テスト

source: Testing an existing native executable
ja_jp: 既存のネイティブ実行可能ファイルのテスト

source: Testing and Running
ja_jp: テストと実行

source: Testing and validating on additional platforms, including Windows.
ja_jp: Windows を含む追加プラットフォームでのテストと検証。

source: Testing authentication to a separate OIDC-like server can be tricky. Quarkus offers several options, from mocking to running a local OIDC provider.
ja_jp: 別の OIDC ライクなサーバーへの認証テストは難しい場合があります。 Quarkus は、モックからローカル OIDC プロバイダーの実行まで、いくつかのオプションを提供します。

source: Testing became easier and consistent
ja_jp: テストが容易になり、一貫性がある状態になりました

source: Testing components
ja_jp: コンポーネントのテスト

source: Testing email sending
ja_jp: メール送信のテスト

source: Testing full Grafana OTel LGTM stack - example
ja_jp: 完全な Grafana OTel LGTM スタックのテスト - 例

source: Testing helpers
ja_jp: テストヘルパー

source: Testing hot reload
ja_jp: ホットリロードのテスト

source: Testing in JVM mode
ja_jp: JVM モードでのテスト

source: Testing in native mode
ja_jp: ネイティブモードでのテスト

source: Testing is often tricky when it comes to authentication to a separate OIDC-like server. Quarkus offers several options from mocking to a local run of an OIDC provider.
ja_jp: 別の OIDC のようなサーバーへの認証に関しては、テストが困難になることがよくあります。 Quarkus は、モックから OIDC プロバイダーのローカル実行まで、さまざまなオプションを提供します。

source: Testing locally
ja_jp: ローカルでのテスト

source: Testing of Quarkus extensions should be done with the `io.quarkus.test.QuarkusUnitTest` JUnit 5 extension. This extension allows for Arquillian-style tests that test specific functionalities. It is not intended for testing user applications, as this should be done via `io.quarkus.test.junit.QuarkusTest`. The main difference is that `QuarkusTest` simply boots the application once at the start of the run, while `QuarkusUnitTest` deploys a custom Quarkus application for each test class.
ja_jp: Quarkus エクステンションのテストは `io.quarkus.test.QuarkusUnitTest` JUnit 5 拡張モジュールを使用してください。このエクステンションを使用すると、特定の機能をテストする Arquillian スタイルのテストを行うことができます。ユーザーアプリケーションのテストは `io.quarkus.test.junit.QuarkusTest` を経由して行う必要があるため、ユーザーアプリケーションのテストを目的としたものではありません。主な違いは、 `QuarkusTest` は実行開始時にアプリケーションを起動するだけで、 `QuarkusUnitTest` は各テストクラスごとにカスタムの Quarkus アプリケーションを展開するという点です。

source: Testing of Quarkus extensions should be done with the `io.quarkus.test.QuarkusUnitTest` JUnit extension. This extension allows for Arquillian-style tests that test specific functionalities. It is not intended for testing user applications, as this should be done via `io.quarkus.test.junit.QuarkusTest`. The main difference is that `QuarkusTest` simply boots the application once at the start of the run, while `QuarkusUnitTest` deploys a custom Quarkus application for each test class.
ja_jp: Quarkus エクステンションのテストは、`io.quarkus.test.QuarkusUnitTest` JUnit エクステンションを使用して行う必要があります。このエクステンションにより、特定の機能をテストする Arquillian スタイルのテストが可能になります。これはユーザーアプリケーションのテストを目的としたものではありません。ユーザーアプリケーションのテストは `io.quarkus.test.junit.QuarkusTest` を介して行う必要があります。主な違いは、`QuarkusTest` は実行開始時にアプリケーションを一度だけ起動するのに対し、`QuarkusUnitTest` は各テストクラスに対してカスタムの Quarkus アプリケーションをデプロイすることです。

source: Testing reactive Panache entities in a `@QuarkusTest` is slightly more complicated than testing regular Panache entities due to the asynchronous nature of the APIs and the fact that all operations need to run on a Vert.x event loop.
ja_jp: `@QuarkusTest` におけるリアクティブPanacheエンティティのテストは、APIの非同期性と、すべての操作がVert.xイベントループ上で実行される必要があるという事実のために、通常のPanacheエンティティのテストよりも若干複雑です。

source: Testing support for CLI applications
ja_jp: CLIアプリケーションのテストサポート

source: Testing the Application
ja_jp: アプリケーションのテスト

source: Testing the Greeting Extension feature
ja_jp: グリーティングエクステンションのテスト

source: Testing the REST API
ja_jp: REST API のテスト

source: Testing the Reactive REST API
ja_jp: リアクティブ REST API のテスト

source: Testing the application
ja_jp: アプリケーションのテスト

source: Testing the framework, not the infrastructure
ja_jp: インフラではなくフレームワークのテスト

source: Testing the native executable
ja_jp: ネイティブ実行可能ファイルのテスト

source: Testing user permissions
ja_jp: ユーザー権限のテスト

source: Testing using a Kafka broker
ja_jp: Kafka ブローカーを使用したテスト

source: Testing virtual thread applications
ja_jp: 仮想スレッドアプリケーションのテスト

source: Testing with Dev Services
ja_jp: Dev Services を使用したテスト

source: Testing with InMemoryConnector
ja_jp: InMemoryConnector を使用したテスト

source: Testing with in-memory databases
ja_jp: インメモリーデータベースを使用したテスト

source: Testing with ngrok
ja_jp: ngrok によるテスト

source: Testing with the SAM CLI
ja_jp: SAM CLI を使用したテスト

source: Testing without a broker
ja_jp: ブローカーなしでのテスト

source: Testing your Quarkus web application with Playwright
ja_jp: Playwright を使用した Quarkus ウェブアプリケーションのテスト

source: Testing your `quarkus-oidc` `service` application with `OidcWiremockTestResource` provides the best coverage as even the communication channel is tested against the Wiremock HTTP stubs. `OidcWiremockTestResource` will be enhanced going forward to support more complex Bearer token test scenarios.
ja_jp: `quarkus-oidc` `service` アプリケーションを `OidcWiremockTestResource` でテストすると、通信チャネルが Wiremock HTTP スタブに対してテストされるため、最高のカバレッジが得られます。 `OidcWiremockTestResource` は、より複雑な Bearer トークンのテストシナリオをサポートするために、今後強化される予定です。

source: Testing your `quarkus-oidc` `service` application with `OidcWiremockTestResource` provides the best coverage as even the communication channel is tested against the Wiremock HTTP stubs. `OidcWiremockTestResource` will be enhanced going forward to support more complex bearer token test scenarios.
ja_jp: `quarkus-oidc` `service` アプリケーションを `OidcWiremockTestResource` でテストすると、通信チャネルまで Wiremock HTTP スタブに対してテストされるため、最高のカバレッジが得られます。 `OidcWiremockTestResource` は今後、より複雑なベアラートークンのテストシナリオをサポートするために拡張される予定です。

source: Testing your `quarkus-oidc` `service` application with `OidcWiremockTestResource` provides the best coverage because even the communication channel is tested against the WireMock HTTP stubs. If you need to run a test with WireMock stubs that are not yet supported by `OidcWiremockTestResource`, you can inject a `WireMockServer` instance into the test class, as shown in the following example:
ja_jp: `OidcWiremockTestResource` を使用して `quarkus-oidc` `service` アプリケーションをテストすると、通信チャネルも WireMock HTTP スタブに対してテストされるため、最大のカバレッジを得ることができます。 `OidcWiremockTestResource` でまだサポートされていない WireMock スタブを使用してテストを実行する必要がある場合は、次の例に示すように、テストクラスに `WireMockServer` インスタンスを挿入できます。

source: Testing your function
ja_jp: 関数のテスト

source: Testing your services
ja_jp: サービスのテスト

source: Testing your web applications
ja_jp: Web アプリケーションのテスト

source: Tests
ja_jp: テスト

source: Tests and Transactions
ja_jp: テストとトランザクション

source: Text in paragraphs, lists, and tables should be broken into pieces that are easier to review{semantic-line-breaks}. Start a new line at the end of each sentence, and split sentences themselves at natural breaks between clauses.
ja_jp: 段落、リスト、および表のテキストは、{semantic-line-breaks} をレビューしやすいように細かく分割する必要があります。各文の終わりで新しい行を開始し、句間の自然な区切りで文自体を分割します。

source: Thank you all for taking the time to report issues, build reproducers... it is immensely helpful and instrumental in making Quarkus better every day.
ja_jp: 問題点の報告や再現手順の作成などに時間を割いていただき、ありがとうございます。

source: Thank you for reading and stay tuned for the next release!
ja_jp: お読みいただきありがとうございました。次のリリースをお待ちください!

source: Thankfully, when using the `kubernetes-config` extension along with the xref:deploying-to-kubernetes.adoc[Kubernetes] extension, all the necessary Kubernetes resources to make that happen are automatically generated.
ja_jp: ありがたいことに、 link:deploying-to-kubernetes[Kubernetes] エクステンションと一緒に `kubernetes-config` エクステンションを使うと、それを実現するために必要なKubernetesリソースがすべて自動的に生成されます。

source: Thankfully, you can use the link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html[`WebAuthnSecurity`] bean to handle the WebAuthn-specific part of your registration and login endpoints, and focus on your own logic:
ja_jp: ありがたいことに、次のリンクを使用できます:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html[`WebAuthnSecurity`] Bean は WebAuthn 固有の部分を処理します 登録とログインのエンドポイントを分離し、独自のロジックに集中します。

source: Thanks
ja_jp: 謝辞

source: Thanks goes to these wonderful people:
ja_jp: 素晴らしい貢献者の皆様に感謝いたします。

source: Thanks to all the contributors who reported issues and provided reproducers: it allowed us to make steady progress on fixing issues.
ja_jp: 問題点を報告し、再現手順を提供してくれたすべての貢献者に感謝します。問題の修正の確かな進捗に繋がりました。

source: Thanks to all the contributors who reported issues and provided reproducers: it really helped a lot!
ja_jp: 問題を報告し、再現手順を提供してくれたすべてのコントリビューターに感謝します。非常に助かりました!

source: Thanks to all the people reporting issues, providing reproducers, fixes..., it's really appreciated.
ja_jp: 問題を報告してくれる人、再現プログラムを提供してくれる人、修正してくれる人...、本当にありがとうございました。

source: Thanks to all your feedback, here comes 1.9.1.Final with bugfixes and documentation improvements.
ja_jp: 皆様のご意見に感謝し、バグフィックスとドキュメントの改善を行った1.9.1.Finalをお届けします。
